{
    "Description Text...": "Beskrivelse Tekst...",
    "Fix current issues": "Løs aktuelle problemer",
    "Fix issues with sandboxing": "Løs problemer med sandkasse",
    "An Application does not work properly when sandboxed": "En applikasjon fungerer ikke riktig sandkasset",
    "Issues with a web browser": "Problemer med en nettleser",
    "Perform Sandbox maintenance": "Utfør Sandbox vedlikehold",
    "Fix issues with the UI or Shell": "Løs problemer med UI eller Shell",
    "Yes": "Ja",
    "No": "Nei",
    "\nPlease note that this required preset works only with a valid supporter certificate!": "\nVær oppmerksom på at denne nødvendige forhåndsinnstillingen bare fungerer med et gyldig støttesertifikat!",
    "App compatibility checker": "App-kompatibilitetskontrollør",
    "This script check which app compatibility templates needs to be enabled": "Dette skriptet sjekk hvilke appkompatibilitetsmaler som må aktiveres",
    "Loaded %1 templates": "Lastet %1 maler",
    "Browser shortcut is missing from the desktop": "Nettlesersnarvei mangler fra skrivebordet",
    "This procedure will add a browser shortcut to the desktop": "Denne prosedyren vil legge til en nettlesersnarvei til skrivebordet",
    "Default Browser": "Standard nettleser",
    "Another": "En annen",
    "Select Browser": "Velg nettleser",
    "Select Sandbox": "Velg Sandkasse",
    "Select which browser you want to create a shortcut for and in what box": "Velg hvilken nettleser du vil opprette en snarvei til og i hvilken boks",
    "Select Browser Path": "Velg nettlesersti",
    "Explorer Context Menu extension does not work": "Utvidelsen Explorer Context Menu fungerer ikke",
    "This procedure will re install the shell integration": "Denne prosedyren vil ominstallere skallintegrasjonen",
    "Add Run Sandboxed": "Legg til «Kjør i sandkasse»",
    "Add Run Unsandboxed": "Legg til «Kjør uten sandkasse»",
    "Install legacy shell extensions": "Installere gamle skalutvidelser",
    "Select which shell options should be reinstalled": "Velg hvilke skallalternativer som skal installeres på nytt",
    "Low FPS in sandboxed games": "Lave FPS i sandkasset spill",
    "This procedure will optimize the box settings for gaming": "Denne prosedyren vil optimalisere boksinnstillingene for spill",
    "Select which box to optimize.": "Velg hvilken boks du vil optimalisere.",
    "To apply recommended settings press NEXT. \n": "Hvis du vil bruke anbefalte innstillinger, trykk NESTE. \n",
    "The options has been applied please tryout your game in %1 and indicate if the issue has been resolved.": "Mulighetene er blitt brukt, prøv spillet i %1 og angi om problemet er løst.",
    "FPS optimization not successful": "FPS optimering ikke vellykket",
    "Failed to install application into a sandbox": "Klarte ikke å installere programmet i en sandkasse",
    "It helps troubleshoot issues related to installing applications in the sandbox": "Det hjelper deg med å feilsøke problemer relatert til å installere programmer i sandkassen",
    "Enter Installer Path": "Skriv inn installeringssti",
    "Select a sandbox to install into": "Velg en sandkasse å installere i",
    "This box has DropAdminRights enabled, preventing execution of installers. Do you want to disable this restriction, that will reduce the security level.": "Denne boksen har DropAdminRights aktivert, og forhindrer kjøring av installeringer. Vil du deaktivere denne begrensningen, som vil redusere sikkerhetsnivået.",
    "Disable DropAdminRights": "Deaktiver DropAdminRights",
    "Enable FakeAdminRights": "Aktiver FakeAdminRights",
    "running installer, pid: %1 press NEXT once it finishes to continue": "kjøre installatør, pid: %1 Trykk NESTE når det er ferdig å fortsette",
    "Was the issue resolved?": "Er problemet løst?",
    "no mitigation worked": "Ingen reduksjon fungert",
    "Webcam or Sound does not work when sandboxed": "Webcam eller Sound virker ikke når sandkasset",
    "It helps troubleshoot webcam and audio issues in the sandbox": "Det hjelper deg med å feilsøke webkamera- og lydproblemer i sandkassen",
    "To enable webcam support on Windows 11, the isolation level must be reduced. \nIf you want to proceed, please press NEXT and select a sandbox to modify. \n": "For å aktivere webkamerastøtte på Windows 11 må isoleringsnivået reduseres.\nHvis du vil fortsette, trykk NESTE og velg en sandkasse for å endre. \n",
    "Select which box to turn into a reduced isolation app compartment box.": "Velg hvilken boks som skal settes i redusert isolasjonsmodus (App Compartment).",
    "The mitigation has been applied please try out the web cam in %1 and indicate if the issue has been resolved.": "Reduksjonen har blitt påført vennligst prøv ut webkameraet i %1 og angi om problemet er løst.",
    "Webcam mitigation not successful": "Webcam reduksjon ikke vellykket",
    "Select affected sandbox": "Velg rammet sandkasse",
    "Enter Process Name": "Skriv inn prosessnavn",
    "SBIE1307: Program cannot access the Internet due to restrictions": "SBIE1307: Programmet kan ikke få tilgang til Internett på grunn av restriksjoner",
    "Program cannot access the Internet due to restrictions": "Programmet kan ikke få tilgang til Internett på grunn av begrensninger",
    "Internet Access restrictions are in effect for the sandbox in which the program is running. The program is prohibited from accessing the Internet.": "Begrensninger for tilgang til Internett er i kraft for den sandkassen som programmet kjører i. Programmet er nektet tilgang til Internett.",
    "SBIE1308: Program cannot start due to restrictions": "SBIE1308: Programmet kan ikke starte på grunn av restriksjoner",
    "Program cannot start due to restrictions": "Programmet kan ikke starte på grunn av restriksjoner",
    "Start/Run restrictions are in effect for the sandbox in which the program is running. The program is prohibited from starting or running.": "Start/kjør restriksjoner er i kraft for sandkassen som programmet kjører i. Programmet er forbudt å starte eller kjøre.",
    "SBIE2102: File is too large to copy into sandbox": "SBIE2102: Filen er for stor til å kopiere til sandkasse",
    "File is too large to copy into sandbox": "Filen er for stor til å kopiere til sandkasse",
    "SBIE2113: File is too large to copy into sandbox, creating empty file": "SBIE2113: Filen er for stor til å kopiere til sandkasse, oppretter tom fil",
    "File is too large to copy into sandbox, creating empty file": "Filen er for stor til å kopiere til sandkasse, opprette tom fil",
    "SBIE2114: File is too large to copy into sandbox, denying access": "SBIE2114: Filen er for stor til å kopiere til sandkasse, nekte tilgang",
    "File is too large to copy into sandbox, denying access": "Filen er for stor til å kopiere til sandkasse, nekte tilgang",
    "SBIE2115: File is too large to copy into sandbox, opening in read only": "SBIE2115: Fila er for stor til å kopiere til sandkasse, åpning i lesebeskyttet",
    "File is too large to copy into sandbox, opening in read only": "Filen er for stor til å kopiere til sandkasse, åpning i lesekun",
    "SBIE2181: Failed to load SbieDll.dll": "SBIE2181: Klarte ikke å laste SbieDll.dll",
    "Fix the DACLs of Sandboxie's home folder": "Løs DACLs av Sandboxies hjemmemappe",
    "Failures to load SbieDll.dll when encountered by Chrome, or another software employing app containers, it is often caused by invalid DACL entries for the Sandboxie home directory. This mitigation measure will fix them, for this reason it will prompt for admin privileges which need to be granted for kmdutil.exe.": "Feil å laste SbieDll.dll når det støttes av Chrome, eller en annen programvare som benytter appbeholdere, er det ofte forårsaket av ugyldige DACL-oppføringer for Sandboxie hjemmemappen. Denne begrensningen tiltak vil fikse dem, av denne grunn vil det be om admin privilegier som må gis for kmdutil.exe.",
    "The DACLs have been adjusted, please try to run your application again and indicate if the issue has been resolved.": "DACL-ene er justert, prøv å kjøre programmet igjen og angi om problemet er løst.",
    "DACLs fix did not resolve the issue": "DACLs fix løste ikke problemet",
    "SBIE2204: Cannot start a specific sandboxed service": "SBIE2204: Kan ikke starte en bestemt sandkasset tjeneste",
    "Sandboxie failed to start a service in the sandbox": "Sandboxie startet ikke en tjeneste i sandkassen",
    "The message indicates that Sandboxie was unable to start one of the helper programs SandboxieRpcSs or SandboxieDcomLaunch. The name noted in the message can be rpcss or dcomlaunch.\n\nYou can submit an issue report on the next page to help us to analyze the issue.": "Meldingen indikerer at Sandboxie ikke klarte å starte et av hjelpeprogrammene SandboxieRpcSs eller SandboxieDcomLaunch. Navnet som er angitt i meldingen kan være rpcss eller dcomlaunch.\n\nDu kan sende inn en problemrapport på neste side for å hjelpe oss å analysere problemet.",
    "SBIE2224: Sandboxed program has crashed": "SBIE2224: Sandboxed-programmet har krasjet",
    "A Sandboxed program has crashed": "Et Sandkasse-program har krasjet",
    "The Process '%1' crashed": "Prosessen '%1' krasjet",
    "This program is known to work in a Green (App Compartment) type sandbox.": "Dette programmet er kjent for å fungere i en Grøn (App Compartment) type sandkasse.",
    "There is no known workaround for this process. Do you want to report this issue?": "Det finnes ingen kjent løsning for denne prosessen. Vil du rapportere dette problemet?",
    "SBIE2313: Could not execute specific process": "SBIE2313: Klarte ikke utføre spesifikk prosess",
    "Sandboxie failed to start a process in the sandbox": "Sandboxie klarte ikke å starte en prosess i sandkassen",
    "Sandboxie was not able to execute one of its own programs. Check access permissions to the Sandboxie installation folder and/or reinstall Sandboxie.\n\nPossible Causes:\n1. Sandboxie was configured to block access to the folder containing its program files.\n2. A third-party (HIPS) security software was configured to block the execution of the program mentioned in the message.\n\nYou can submit an issue report on the next page to help us to analyze the issue.": "Sandboxie klarte ikke å utføre et av sine egne programmer. Sjekk tilgangsløyve til installasjonsmappen Sandboxie og/eller installer Sandboxie på nytt.\n\nMulige årsaker:\n1. Sandboxie ble konfigurert til å blokkere tilgang til mappen som inneholder sine programfiler.\n2. En tredjeparts (HIPS) sikkerhetsprogramvare ble konfigurert til å blokkere gjennomføringen av programmet nevnt i meldingen.\n\nDu kan sende inn en problemrapport på neste side for å hjelpe oss å analysere problemet.",
    "open config": "åpne konfigurasjon",
    "opens box config on a given page": "åpner boksoppsett på en gitt side",
    "Do you want to open the box option dialog to change this preset?": "Vil du åpne dialogboksen for boksvalg for å endre denne forhåndsinnstillingen?",
    "No, it is fine as it is": "Nei, det er fint som det er",
    "No, but I want to report a bug": "Nei, men jeg vil rapportere en feil",
    "SBIE 2113/2114/2115 and 2102": "SBIE 2113/2114/2115 og 2102",
    "handle migration error messages": "håndtere migrasjonsfeilmeldinger",
    "The message %1 is caused by the file migration limit being reached.": "Meldingen %1 er forårsaket av fil migrasjonsgrensen som ble nådd.",
    "fix parental controls breaking sandboxie": "fikse foreldrekontroll som knekker sandkasse",
    "stops AppId driver and AppIdSvc service and disables the offending policy file": "Stopper AppId driver og AppIdSvc-tjeneste og deaktiverer den ansvarlige policyfilen",
    "It seems you are using a non-administrative user account on a system with enabled parental controls, this is known to be incompatible with Sandboxie.\nYou have the following options to resolve the issue.": "Det ser ut til at du bruker en ikke-administrativ brukerkonto på et system med aktivert foreldrekontroll, dette er kjent for å være uforenelig med Sandboxie.\nDu har følgende alternativer for å løse problemet.",
    "SBIEMSG, I'm getting a cryptic SBIExxxx message": "SBIEMSG, jeg får en kryptisk SBIExxxx melding",
    "Handle all sbie messages...": "Håndter alle sbie meldinger...",
    "Sbie Message Code": "Sbie Meldingskode",
    "Name affected process": "Navn påført prosess",
    "Please enter the SBIEMSG ID you have encountered.": "Vennligst skriv inn SBIEMSG ID du har møtt.",
    "There is no automated troubleshooting available for SBIE%1 yet.<br />": "Det er ingen automatisk feilsøking tilgjengelig for SBIE%1 ennå.<br />",
    "The full message text is: %1<br />": "Hele meldingsteksten er: %1<br />",
    "Visit out <a href=\"%1\">online-documentation</a> to learn more about this, and other sbie messages.": "Besøk <a href=\"%1\">online-dokumentasjon</a> å lære mer om dette, og andre sbie meldinger.",
    "Would you like to collect some logs to help us resolve the issue.": "Vil du samle noen logger for å hjelpe oss å løse problemet.",
    "Now please run your application again to trigger the Sbie message.<br /><br />": "Vennligst kjør programmet igjen for å utløse Sbie-meldingen.<br /><br />",
    "Press NEXT when you are done collecting logs.": "Trykk NESTE når du er ferdig med å samle logger.",
    "Unknown application crashed": "Ukjent program krasjet",
    "An Unknown application crashed": "Et ukjent program krasjet",
    "Do you want to report this issue?": "Vil du rapportere dette problemet?",
    "Viber crashes on startup": "Viber krasjer ved oppstart",
    "The Viber messenger crashes on startup": "Viber Messenger krasjer ved oppstart",
    "Viber is not compatible with the standard isolation yellow type Sandbox. However is known to work in a Green (App Compartment) type sandbox.": "Viber er ikke kompatibel med standardisolasjons gul type Sandkasse. Men det er kjent å jobbe i en grønn (App Compartment) type sandkasse."
}
