{
"Description Text...": "请选择最适合你目前问题的解释说明...",
"Fix current issues": "解决当前的问题",
"Fix issues with sandboxing": "解决沙箱/应用沙箱化时的问题",
"An Application does not work properly when sandboxed": "应用程序在沙箱内时无法正常工作",
"Issues with a web browser": "网络浏览器问题",
"Perform Sandbox maintenance": "执行沙箱的维护操作",
"Fix issues with the UI or Shell": "解决 用户界面（UI） 或 Windows 资源管理器（Shell） 问题",

"Yes": "是",
"No": "否",
"\nPlease note that this required preset works only with a valid supporter certificate!": "\n请注意，此必需的预设仅适用于有效的支持者证书！",

"App compatibility checker": "应用程序兼容性检查器",
"This script check which app compatibility templates needs to be enabled": "此检查步骤需要启用有问题应用的兼容性模板",
"Loaded %1 templates": "已加载 %1 个模板",

"Browser shortcut is missing from the desktop": "桌面上缺少沙箱中浏览器的快捷方式",
"This procedure will add a browser shortcut to the desktop": "此步骤会将沙箱中浏览器的快捷方式添加到桌面",
"Default Browser": "默认浏览器",
"Another": "其他",
"Select Browser": "选择浏览器",
"Select Sandbox": "选择一个沙箱",
"Select which browser you want to create a shortcut for and in what box": "选择要在哪个沙箱中为哪个浏览器创建快捷方式",
"Select Browser Path": "选择浏览器路径",

"Explorer Context Menu extension does not work": "Windows 资源管理器上/下文菜单的扩展选项（例如按钮/右键菜单）不工作",
"This procedure will re install the shell integration": "此步骤将重新安装 Windows 资源管理器（Shell） 集成项",
"Add Run Sandboxed": "安装沙箱内的",
"Add Run Unsandboxed": "安装沙箱外的",
"Install legacy shell extensions": "安装旧的 Windows 资源管理器（Shell） 扩展",
"Select which shell options should be reinstalled": "选择应重新安装的 Windows 资源管理器（Shell） 选项",

"Low FPS in sandboxed games": "降低沙箱中游戏的 FPS",
"This procedure will optimize the box settings for gaming": "此流程将对沙箱的设置为游戏进行优化",
"Select which box to optimize.": "选择哪个沙箱进行优化。",
"To apply recommended settings press NEXT. \n": "按 下一步 来应用建议的设置。 \n",
"The options has been applied please tryout your game in %1 and indicate if the issue has been resolved.": "此选项已被应用，请在 %1 尝试你的游戏，并指出问题是否被解决。",
"FPS optimization not successful": "FPS 优化未成功",

"Failed to install application into a sandbox": "无法将应用程序安装到沙箱中",
"It helps troubleshoot issues related to installing applications in the sandbox": "它帮助排除有关于在沙箱中安装应用程序的故障",
"Enter Installer Path": "输入安装程序路径",
"Select a sandbox to install into": "选择将要安装到的沙箱",
"This box has DropAdminRights enabled, preventing execution of installers. Do you want to disable this restriction, that will reduce the security level.": "此沙箱启用了 “撤销管理员和 Power User 用户组的权限” 选项，它阻止了安装程序执行。要禁用此限制吗？这将降低安全级别。",
"Disable DropAdminRights": "关闭 “撤销管理员和 Power User 用户组的权限” 选项",
"Enable FakeAdminRights": "启用 “使应用程序认为自己已被提权运行” 选项",
"running installer, pid: %1 press NEXT once it finishes to continue": "正在运行安装程序，（pid: %1） 完成后按 下一步 继续",
"Was the issue resolved?": "问题解决了吗?",
"no mitigation worked": "没有解决措施起作用",

"Webcam or Sound does not work when sandboxed": "网络摄像头或声音在沙箱中无法使用/不能播放",
"It helps troubleshoot webcam and audio issues in the sandbox": "它帮助排除在沙箱中网络摄像头和声音的故障",
"To enable webcam support on Windows 11, the isolation level must be reduced. \nIf you want to proceed, please press NEXT and select a sandbox to modify. \n": "要在 Windows 11 上启用网络摄像头支持，必须降低隔离级别。\n如果要继续，请按 下一步 并选择要修改的沙箱。\n",
"Select which box to turn into a reduced isolation app compartment box.": "选择将哪个沙箱转换为降低的隔离级别的沙箱。",
"The mitigation has been applied please try out the web cam in %1 and indicate if the issue has been resolved.": "已应用解决措施，请试用 %1 中的网络摄像头，并指示问题是否已解决。",
"Webcam mitigation not successful": "网络摄像头解决措施不成功",

"Select affected sandbox": "选择受影响的沙箱",
"Enter Process Name": "输入进程名称",

"SBIE1307: Program cannot access the Internet due to restrictions": "SBIE1307: 由于限制，程序无法访问互联网",
"Program cannot access the Internet due to restrictions": "由于限制，程序无法访问互联网",
"Internet Access restrictions are in effect for the sandbox in which the program is running. The program is prohibited from accessing the Internet.": "“Internet 访问限制” 在运行该程序的沙箱被开启，因此该程序被禁止访问互联网。",

"SBIE1308: Program cannot start due to restrictions": "SBIE1308: 由于限制，程序无法启动",
"Program cannot start due to restrictions": "由于限制，程序无法启动",
"Start/Run restrictions are in effect for the sandbox in which the program is running. The program is prohibited from starting or running.": "“启动/运行限制” 在运行该程序的沙箱被开启，该程序被禁止启动或运行。",

"SBIE2102: File is too large to copy into sandbox": "SBIE2102: 复制进沙箱中的文件太大",
"File is too large to copy into sandbox": "复制进沙箱中的文件太大",

"SBIE2113: File is too large to copy into sandbox, creating empty file": "SBIE2113: 复制进沙箱中的文件太大, 正在创建空文件",
"File is too large to copy into sandbox, creating empty file": "复制进沙箱中的文件太大, 正在创建空文件",

"SBIE2114: File is too large to copy into sandbox, denying access": "SBIE2114: 复制进沙箱中的文件太大, 正在拒绝访问"
"File is too large to copy into sandbox, denying access": "复制进沙箱中的文件太大, 正在拒绝访问",

"SBIE2115: File is too large to copy into sandbox, opening in read only": "SBIE2115: 复制进沙箱中的文件太大, 正在以只读模式打开",
"File is too large to copy into sandbox, opening in read only": "复制进沙箱中的文件太大, 正在以只读模式打开",

"SBIE2181: Failed to load SbieDll.dll": "SBIE2181: 加载 SbieDll.dll 失败",
"Fix the DACLs of Sandboxie's home folder": "修复 Sandboxie 主文件夹的 DACL 条目",
"Failures to load SbieDll.dll when encountered by Chrome, or another software employing app containers, it is often caused by invalid DACL entries for the Sandboxie home directory. This mitigation measure will fix them, for this reason it will prompt for admin privileges which need to be granted for kmdutil.exe.": "Chrome 或其他使用应用容器的软件遇到无法加载 SbieDll.dll 时，通常是由 Sandboxie 主目录的无效 DACL 条目引起的。此解决措施将修复它们，这将提示需要为 kmdutil.exe 授予管理员权限。",
"The DACLs have been adjusted, please try to run your application again and indicate if the issue has been resolved.": "“DACL 条目” 已调整，请尝试再次运行应用程序，并在稍后关注/指示问题是否已解决。",
"DACLs fix did not resolve the issue": "“DACL 条目修复” 未解决问题",

"SBIE2204: Cannot start a specific sandboxed service": "SBIE2204: 无法启动特定的沙箱化服务。",
"Sandboxie failed to start a service in the sandbox": "Sandboxie 无法在沙箱中启动服务",
"The message indicates that Sandboxie was unable to start one of the helper programs SandboxieRpcSs or SandboxieDcomLaunch. The name noted in the message can be rpcss or dcomlaunch.\n\nYou can submit an issue report on the next page to help us to analyze the issue.": "该消息指示 Sandboxie 无法启动帮助程序 SandboxieRpcSs 或 SandboxieDcomLaunch 之一。消息中记下的名称可为 rpcss 或 dcomlaunch。\n\n您可以在下一页上提交问题报告，以帮助我们分析问题。",

"SBIE2224: Sandboxed program has crashed":"SBIE2224：沙箱内程序已崩溃",
"A Sandboxed program has crashed":"沙箱中的程序已崩溃",
"The Process '%1' crashed":"进程 '%1' 已崩溃",
"This program is known to work in a Green (App Compartment) type sandbox.":"该程序可在绿色（应用隔离）型沙箱中正常运行。",
"There is no known workaround for this process. Do you want to report this issue?":"该进程暂无已知解决方案。是否要报告此问题？",

"SBIE2313: Could not execute specific process": "SBIE2313: 无法运行一个特定的进程",
"Sandboxie failed to start a process in the sandbox": "Sandboxie 在沙箱中启动进程失败",
"Sandboxie was not able to execute one of its own programs. Check access permissions to the Sandboxie installation folder and/or reinstall Sandboxie.\n\nPossible Causes:\n1. Sandboxie was configured to block access to the folder containing its program files.\n2. A third-party (HIPS) security software was configured to block the execution of the program mentioned in the message.\n\nYou can submit an issue report on the next page to help us to analyze the issue.": "Sandboxie 无法执行自己的程序之一。请检查您当前的用户账户对 Sandboxie 的安装文件夹 是否具有可访问权，并且(或者)重新安装 Sandboxie。\n\n可能的原因:\n1. Sandboxie 被配置为阻止对包含其程序文件的文件夹的访问。\n2. 系统中被配置了第三方(HIPS)安全软件来阻止消息中提到的程序的执行。\n\n您可以在下一页提交问题报告，以帮助我们分析问题。",

"open config": "打开配置",
"opens box config on a given page": "在已给出的页面中打开沙箱配置",
"Do you want to open the box option dialog to change this preset?": "是否要打开沙箱选项对话框来更改此预设？",
"No, it is fine as it is": "不，我觉得这样就好",
"No, but I want to report a bug": "不，我要报告错误",

"SBIE 2113/2114/2115 and 2102": "SBIE 2113/2114/2115 以及 2102",
"handle migration error messages": "处理迁移错误消息",
"The message %1 is caused by the file migration limit being reached.": "消息 %1 是因为文件迁移请求达到限制引起的。",

"fix parental controls breaking sandboxie": "修复导致 Sandboxie 功能失效的家长控制问题",
"stops AppId driver and AppIdSvc service and disables the offending policy file": "停止 AppId 驱动程序和 AppIdSvc 服务，并禁用有问题的策略文件",
"It seems you are using a non-administrative user account on a system with enabled parental controls, this is known to be incompatible with Sandboxie.\nYou have the following options to resolve the issue.": "您似乎在启用了家长控制的系统上使用非管理员用户帐户，这种情况下 Sandboxie 显然不会被兼容。\n您可以通过以下选项来解决此问题。",

"SBIEMSG, I'm getting a cryptic SBIExxxx message": "SBIEMSG, 我收到一条神秘的 SBIExxxx 消息",
"Handle all sbie messages...": "处理所有 sbie 消息...",
"Sbie Message Code": "Sbie 消息代码",
"Name affected process": "受影响进程的名称",
"Please enter the SBIEMSG ID you have encountered.": "请输入您遇到的 SBIEMSG ID。",
"There is no automated troubleshooting available for SBIE%1 yet.<br />": "SBIE%1 暂时还没有可用的自动故障排除方法。<br />",
"The full message text is: %1<br />": "完整的消息文本是: %1<br />",
"Visit out <a href=\"%1\">online-documentation</a> to learn more about this, and other sbie messages.": "访问 <a href=\"%1\">在线文档</a> to 了解更多关于此信息，以及其他 Sbie 信息。",
"Would you like to collect some logs to help us resolve the issue.": "是否要收集一些日志来帮助我们解决问题？",
"Now please run your application again to trigger the Sbie message.<br /><br />": "现在，请再次运行您的应用程序以触发 SBIE 消息。<br /><br />",
"Press NEXT when you are done collecting logs.": "完成日志收集后按 下一步 。",

"Unknown application crashed":"未知的应用程序已崩溃",
"An Unknown application crashed":"一个未知的应用程序已崩溃",
"Do you want to report this issue?":"你要报告此问题吗？",

"Viber crashes on startup":"Viber 在启动时崩溃",
"The Viber messenger crashes on startup":"Viber即时通讯软件在启动时崩溃了",
"Viber is not compatible with the standard isolation yellow type Sandbox. However is known to work in a Green (App Compartment) type sandbox.":"Viber 与标准隔离的黄色沙箱不兼容。但是在绿色（应用隔离）的沙箱中正常运行。"
}
