{
"Description Text...": "説明テキスト...",
"Fix current issues": "現在の問題を修正",
"Fix issues with sandboxing": "サンドボックスに関する問題を修正",
"An Application does not work properly when sandboxed": "サンドボックス内でアプリケーションが正常に動作しない",
"Issues with a web browser": "Webブラウザに関する問題",
"Perform Sandbox maintenance": "サンドボックスのメンテナンスを実行",
"Fix issues with the UI or Shell": "UIまたはシェルに関する問題を修正",

"Yes": "はい",
"No": "いいえ",
"\nPlease note that this required preset works only with a valid supporter certificate!": "\nこの必須プリセットは、有効なサポーター証明書がある場合にのみ機能することにご注意ください！",

"App compatibility checker": "アプリ互換性チェッカー",
"This script check which app compatibility templates needs to be enabled": "このスクリプトは、どのアプリ互換性テンプレートを有効にする必要があるかを確認します",
"Loaded %1 templates": "%1 個のテンプレートを読み込みました",

"Browser shortcut is missing from the desktop": "デスクトップにブラウザのショートカットがありません",
"This procedure will add a browser shortcut to the desktop": "この手順により、デスクトップにブラウザのショートカットが追加されます",
"Default Browser": "デフォルトのブラウザ",
"Another": "その他",
"Select Browser": "ブラウザを選択",
"Select Sandbox": "サンドボックスを選択",
"Select which browser you want to create a shortcut for and in what box": "ショートカットを作成したいブラウザと、その作成先となるボックスを選択してください",
"Select Browser Path": "ブラウザのパスを選択",

"Explorer Context Menu extension does not work": "エクスプローラーのコンテキストメニュー拡張機能が動作しません",
"This procedure will re install the shell integration": "この手順により、シェル統合が再インストールされます",
"Add Run Sandboxed": "「サンドボックス内で実行」を追加",
"Add Run Unsandboxed": "「サンドボックス化せずに実行」を追加",
"Install legacy shell extensions": "レガシーシェル拡張機能をインストール",
"Select which shell options should be reinstalled": "再インストールするシェルオプションを選択してください",

"Low FPS in sandboxed games": "サンドボックス化したゲームでFPSが低い",
"This procedure will optimize the box settings for gaming": "この手順により、ゲーム用にボックス設定が最適化されます",
"Select which box to optimize.": "最適化するボックスを選択してください。",
"To apply recommended settings press NEXT. \n": "推奨設定を適用するには、「次へ」を押してください。\n",
"The options has been applied please tryout your game in %1 and indicate if the issue has been resolved.": "オプションが適用されました。%1 でゲームを試し、問題が解決したかどうかをお知らせください。",
"FPS optimization not successful": "FPSの最適化に成功しませんでした",

"Failed to install application into a sandbox": "サンドボックスへのアプリケーションのインストールに失敗しました",
"It helps troubleshoot issues related to installing applications in the sandbox": "サンドボックスへのアプリケーションのインストールに関する問題のトラブルシューティングに役立ちます",
"Enter Installer Path": "インストーラーのパスを入力",
"Select a sandbox to install into": "インストール先のサンドボックスを選択",
"This box has DropAdminRights enabled, preventing execution of installers. Do you want to disable this restriction, that will reduce the security level.": "このボックスではDropAdminRightsが有効になっており、インストーラーの実行が妨げられています。セキュリティレベルが低下しますが、この制限を無効にしますか？",
"Disable DropAdminRights": "DropAdminRightsを無効にする",
"Enable FakeAdminRights": "FakeAdminRightsを有効にする",
"running installer, pid: %1 press NEXT once it finishes to continue": "インストーラーを実行中 (PID: %1)。完了したら「次へ」を押して続行してください",
"Was the issue resolved?": "問題は解決しましたか？",
"no mitigation worked": "どの緩和策も効果がありませんでした",

"Webcam or Sound does not work when sandboxed": "サンドボックス内でウェブカメラまたはサウンドが動作しません",
"It helps troubleshoot webcam and audio issues in the sandbox": "サンドボックス内でのウェブカメラとオーディオの問題のトラブルシューティングに役立ちます",
"To enable webcam support on Windows 11, the isolation level must be reduced. \nIf you want to proceed, please press NEXT and select a sandbox to modify. \n": "Windows 11でウェブカメラのサポートを有効にするには、分離レベルを下げる必要があります。\n続行する場合は、「次へ」を押して変更するサンドボックスを選択してください。\n",
"Select which box to turn into a reduced isolation app compartment box.": "低分離レベルのアプリ区画にするボックスを選択してください。",
"The mitigation has been applied please try out the web cam in %1 and indicate if the issue has been resolved.": "緩和策が適用されました。%1 でウェブカメラを試し、問題が解決したかどうかをお知らせください。",
"Webcam mitigation not successful": "ウェブカメラの緩和策は成功しませんでした",

"Select affected sandbox": "影響を受けるサンドボックスを選択",
"Enter Process Name": "プロセス名を入力",

"SBIE1307: Program cannot access the Internet due to restrictions": "SBIE1307: 制限により、プログラムはインターネットにアクセスできません",
"Program cannot access the Internet due to restrictions": "制限により、プログラムはインターネットにアクセスできません",
"Internet Access restrictions are in effect for the sandbox in which the program is running. The program is prohibited from accessing the Internet.": "プログラムが実行されているサンドボックスでは、インターネットアクセス制限が有効になっています。プログラムはインターネットへのアクセスを禁止されています。",

"SBIE1308: Program cannot start due to restrictions": "SBIE1308: 制限により、プログラムを起動できません",
"Program cannot start due to restrictions": "制限により、プログラムを起動できません",
"Start/Run restrictions are in effect for the sandbox in which the program is running. The program is prohibited from starting or running.": "プログラムが実行されているサンドボックスでは、開始/実行の制限が有効になっています。プログラムの開始または実行は禁止されています。",

"SBIE2102: File is too large to copy into sandbox": "SBIE2102: ファイルが大きすぎるため、サンドボックスにコピーできません",
"File is too large to copy into sandbox": "ファイルが大きすぎるため、サンドボックスにコピーできません",

"SBIE2113: File is too large to copy into sandbox, creating empty file": "SBIE2113: ファイルが大きすぎるためサンドボックスにコピーできません。空のファイルを作成しています",
"File is too large to copy into sandbox, creating empty file": "ファイルが大きすぎるためサンドボックスにコピーできません。空のファイルを作成しています",

"SBIE2114: File is too large to copy into sandbox, denying access": "SBIE2114: ファイルが大きすぎるためサンドボックスにコピーできません。アクセスを拒否しています",
"File is too large to copy into sandbox, denying access": "ファイルが大きすぎるためサンドボックスにコピーできません。アクセスを拒否しています",

"SBIE2115: File is too large to copy into sandbox, opening in read only": "SBIE2115: ファイルが大きすぎるためサンドボックスにコピーできません。読み取り専用で開いています",
"File is too large to copy into sandbox, opening in read only": "ファイルが大きすぎるためサンドボックスにコピーできません。読み取り専用で開いています",

"SBIE2181: Failed to load SbieDll.dll": "SBIE2181: SbieDll.dllの読み込みに失敗しました",
"Fix the DACLs of Sandboxie's home folder": "SandboxieのホームフォルダーのDACLを修正する",
"Failures to load SbieDll.dll when encountered by Chrome, or another software employing app containers, it is often caused by invalid DACL entries for the Sandboxie home directory. This mitigation measure will fix them, for this reason it will prompt for admin privileges which need to be granted for kmdutil.exe.": "Chromeやアプリコンテナーを使用する他のソフトウェアでSbieDll.dllの読み込みに失敗する場合、多くはSandboxieのホームディレクトリのDACLエントリが無効であることが原因です。この緩和策はそれらを修正します。このため、kmdutil.exeに付与する必要がある管理者権限のプロンプトが表示されます。",
"The DACLs have been adjusted, please try to run your application again and indicate if the issue has been resolved.": "DACLが調整されました。アプリケーションを再度実行し、問題が解決したかどうかをお知らせください。",
"DACLs fix did not resolve the issue": "DACLの修正では問題が解決しませんでした",

"SBIE2204: Cannot start a specific sandboxed service": "SBIE2204: 特定のサンドボックス化されたサービスを開始できません",
"Sandboxie failed to start a service in the sandbox": "Sandboxieはサンドボックス内のサービスの開始に失敗しました",
"The message indicates that Sandboxie was unable to start one of the helper programs SandboxieRpcSs or SandboxieDcomLaunch. The name noted in the message can be rpcss or dcomlaunch.\n\nYou can submit an issue report on the next page to help us to analyze the issue.": "このメッセージは、SandboxieがヘルパープログラムであるSandboxieRpcSsまたはSandboxieDcomLaunchのいずれかを開始できなかったことを示します。メッセージに記載されている名前はrpcssまたはdcomlaunchです。\n\n次のページで問題レポートを送信して、問題の分析にご協力いただけます。",

"SBIE2224: Sandboxed program has crashed": "SBIE2224: サンドボックス化されたプログラムがクラッシュしました",
"A Sandboxed program has crashed": "サンドボックス化されたプログラムがクラッシュしました",
"The Process '%1' crashed": "プロセス「%1」がクラッシュしました",
"This program is known to work in a Green (App Compartment) type sandbox.": "このプログラムは、グリーン（アプリコンパートメント）タイプのサンドボックスで動作することが知られています。",
"There is no known workaround for this process. Do you want to report this issue?": "このプロセスには既知の回避策がありません。この問題を報告しますか？",

"SBIE2313: Could not execute specific process": "SBIE2313: 特定のプロセスを実行できませんでした",
"Sandboxie failed to start a process in the sandbox": "Sandboxieはサンドボックス内でプロセスの開始に失敗しました",
"Sandboxie was not able to execute one of its own programs. Check access permissions to the Sandboxie installation folder and/or reinstall Sandboxie.\n\nPossible Causes:\n1. Sandboxie was configured to block access to the folder containing its program files.\n2. A third-party (HIPS) security software was configured to block the execution of the program mentioned in the message.\n\nYou can submit an issue report on the next page to help us to analyze the issue.": "Sandboxieは自身のプログラムの1つを実行できませんでした。Sandboxieのインストールフォルダーへのアクセス許可を確認するか、Sandboxieを再インストールしてください。\n\n考えられる原因:\n1. Sandboxieが、そのプログラムファイルを含むフォルダーへのアクセスをブロックするように構成されていました。\n2. サードパーティ製の(HIPS)セキュリティソフトウェアが、メッセージに記載されているプログラムの実行をブロックするように構成されていました。\n\n次のページで問題レポートを送信して、問題の分析にご協力いただけます。",

"open config": "設定を開く",
"opens box config on a given page": "指定されたページでボックス設定を開きます",
"Do you want to open the box option dialog to change this preset?": "ボックスオプションのダイアログを開いて、このプリセットを変更しますか？",
"No, it is fine as it is": "いいえ、このままで問題ありません",
"No, but I want to report a bug": "いいえ、しかしバグを報告したいです",

"SBIE 2113/2114/2115 and 2102": "SBIE 2113/2114/2115 および 2102",
"handle migration error messages": "移行エラーメッセージを処理する",
"The message %1 is caused by the file migration limit being reached.": "メッセージ %1 は、ファイル移行の制限に達したことが原因です。",

"fix parental controls breaking sandboxie": "Sandboxieを破損させる保護者による制限を修正する",
"stops AppId driver and AppIdSvc service and disables the offending policy file": "AppIDドライバーとAppIDSvcサービスを停止し、問題のあるポリシーファイルを無効にします",
"It seems you are using a non-administrative user account on a system with enabled parental controls, this is known to be incompatible with Sandboxie.\nYou have the following options to resolve the issue.": "保護者による制限が有効なシステムで、管理者ではないユーザーアカウントを使用しているようです。これはSandboxieと互換性がないことが知られています。\n問題を解決するには、次のオプションがあります。",

"SBIEMSG, I'm getting a cryptic SBIExxxx message": "SBIEMSG、不可解なSBIExxxxメッセージが表示されます",
"Handle all sbie messages...": "すべてのSBIEメッセージを処理...",
"Sbie Message Code": "SBIEメッセージコード",
"Name affected process": "影響を受けるプロセスの名前",
"Please enter the SBIEMSG ID you have encountered.": "表示されたSBIEMSG IDを入力してください。",
"There is no automated troubleshooting available for SBIE%1 yet.<br />": "SBIE%1 には、まだ利用可能な自動トラブルシューティングがありません。<br />",
"The full message text is: %1<br />": "完全なメッセージテキストは次のとおりです: %1<br />",
"Visit out <a href=\"%1\">online-documentation</a> to learn more about this, and other sbie messages.": "これや他のSBIEメッセージの詳細については、<a href=\"%1\">オンラインドキュメント</a>をご覧ください。",
"Would you like to collect some logs to help us resolve the issue.": "問題解決に役立てるため、ログを収集しますか？",
"Now please run your application again to trigger the Sbie message.<br /><br />": "それでは、アプリケーションを再度実行して、SBIEメッセージを発生させてください。<br /><br />",
"Press NEXT when you are done collecting logs.": "ログの収集が完了したら、「次へ」を押してください。",

"Unknown application crashed": "不明なアプリケーションがクラッシュしました",
"An Unknown application crashed": "不明なアプリケーションがクラッシュしました",
"Do you want to report this issue?": "この問題を報告しますか？",

"Viber crashes on startup": "起動時にViberがクラッシュします",
"The Viber messenger crashes on startup": "Viberメッセンジャーが起動時にクラッシュします",
"Viber is not compatible with the standard isolation yellow type Sandbox. However is known to work in a Green (App Compartment) type sandbox.": "Viberは、標準的な分離であるイエロータイプのサンドボックスと互換性がありません。ただし、グリーン（アプリコンパートメント）タイプのサンドボックスで動作することが知られています。"
}
