{
"Description Text...": "Texto de Descrição...",
"Fix current issues": "Corrigir problemas atuais",
"Fix issues with sandboxing": "Corrigir problemas com sandbox",
"An Application does not work properly when sandboxed": "Um aplicativo não funciona corretamente quando está no sandbox",
"Issues with a web browser": "Problemas com um navegador web",
"Perform Sandbox maintenance": "Execute a manutenção do Sandbox",
"Fix issues with the UI or Shell": "Corrigir problemas com a IU ou Shell",

"Yes": "Sim",
"No": "Não",
"\nPlease note that this required preset works only with a valid supporter certificate!": "\nObserve que essa predefinição obrigatória funciona apenas com um certificado de apoiador válido!",

"App compatibility checker": "Verificador de compatibilidade de aplicativos",
"This script check which app compatibility templates needs to be enabled": "Esse script verifica quais modelos de compatibilidade de aplicativos precisam ser ativados",
"Loaded %1 templates": "Carregado %1 modelos",

"Browser shortcut is missing from the desktop": "O atalho do navegador está faltando na área de trabalho",
"This procedure will add a browser shortcut to the desktop": "Esse procedimento adicionará um atalho do navegador à área de trabalho",
"Default Browser": "Navegador Padrão",
"Another": "Outro",
"Select Browser": "Selecione o Navegador",
"Select Sandbox": "Selecione a Caixa de areia",
"Select which browser you want to create a shortcut for and in what box": "Selecione para qual navegador você deseja criar um atalho e em qual caixa",
"Select Browser Path": "Selecione o Caminho do Navegador",

"Explorer Context Menu extension does not work": "A extensão do Menu de Contexto do Explorer não funciona",
"This procedure will re install the shell integration": "Esse procedimento irá reinstalar a integração do shell",
"Add Run Sandboxed": "Adicionar Executar na Caixa de Areia",
"Add Run Unsandboxed": "Adicionar Executar Fora da Caixa",
"Install legacy shell extensions": "Instalar extensões de shell herdadas",
"Select which shell options should be reinstalled": "Selecione quais opções de shell devem ser reinstaladas",

"Low FPS in sandboxed games": "Baixo FPS em jogos no sandbox",
"This procedure will optimize the box settings for gaming": "Esse procedimento otimizará as configurações da caixa para jogos",
"Select which box to optimize.": "Selecione qual caixa otimizar.",
"To apply recommended settings press NEXT. \n": "Para aplicar as configurações recomendadas, pressione PRÓXIMO. \n",
"The options has been applied please tryout your game in %1 and indicate if the issue has been resolved.": "As opções foram aplicadas. Experimente seu jogo em %1 e indique se o problema foi resolvido.",
"FPS optimization not successful": "Otimização de FPS não foi bem-sucedida",

"Failed to install application into a sandbox": "Falha ao instalar um aplicativo no sandbox",
"It helps troubleshoot issues related to installing applications in the sandbox": "Ajuda a solucionar problemas relacionados à instalação de aplicativos no sandbox",
"Enter Installer Path": "Insira o caminho do instalador",
"Select a sandbox to install into": "Selecione uma caixa para instalar",
"This box has DropAdminRights enabled, preventing execution of installers. Do you want to disable this restriction, that will reduce the security level.": "Essa caixa possui DropAdminRights habilitado, impedindo a execução de instaladores. Deseja desativar essa restrição, isso reduzirá o nível de segurança.",
"Disable DropAdminRights": "Desativar DropAdminRights",
"Enable FakeAdminRights": "Ativar FakeAdminRights",
"running installer, pid: %1 press NEXT once it finishes to continue": "executando o instalador, pid: %1 pressione PRÓXIMO assim que terminar para continuar",
"Was the issue resolved?": "O problema foi resolvido?",
"no mitigation worked": "nenhuma mitigação funcionou",

"Webcam or Sound does not work when sandboxed": "Webcam ou som não funcionam no sandbox",
"It helps troubleshoot webcam and audio issues in the sandbox": "Ajuda a solucionar problemas de webcam e áudio no sandbox",
"To enable webcam support on Windows 11, the isolation level must be reduced. \nIf you want to proceed, please press NEXT and select a sandbox to modify. \n": "Para habilitar o suporte a webcam no Windows 11, o nível de isolamento deve ser reduzido. \nSe você quiser continuar, pressione PRÓXIMO e selecione uma sandbox para modificar. \n",
"Select which box to turn into a reduced isolation app compartment box.": "Selecione qual caixa transformar em uma caixa de compartimento de aplicativo com isolamento reduzido.",
"The mitigation has been applied please try out the web cam in %1 and indicate if the issue has been resolved.": "A mitigação foi aplicada. Experimente a webcam em %1 e indique se o problema foi resolvido.",
"Webcam mitigation not successful": "A mitigação da webcam não foi bem-sucedida",

"Select affected sandbox": "Selecione a caixa afetada",
"Enter Process Name": "Insira o Nome do Processo",

"SBIE1307: Program cannot access the Internet due to restrictions": "SBIE1307: O programa não consegue acessar a Internet devido a restrições",
"Program cannot access the Internet due to restrictions": "O programa não pode acessar a Internet devido a restrições",
"Internet Access restrictions are in effect for the sandbox in which the program is running. The program is prohibited from accessing the Internet.": "As restrições de acesso à Internet estão em vigor para a sandbox na qual o programa está sendo executado. O programa está proibido de acessar a Internet.",

"SBIE1308: Program cannot start due to restrictions": "SBIE1308: O programa não pode ser iniciado devido a restrições",
"Program cannot start due to restrictions": "O programa não pode ser iniciado devido a restrições",
"Start/Run restrictions are in effect for the sandbox in which the program is running. The program is prohibited from starting or running.": "As restrições de inicialização/execução estão em vigor para o sandbox no qual o programa está sendo executado. O programa está proibido de iniciar ou executar.",

"SBIE2102: File is too large to copy into sandbox": "SBIE2102: O arquivo é muito grande para ser copiado para o sandbox",
"File is too large to copy into sandbox": "O arquivo é muito grande para ser copiado para o sandbox",

"SBIE2113: File is too large to copy into sandbox, creating empty file": "SBIE2113: O arquivo é muito grande para ser copiado para o sandbox, criando um arquivo vazio",
"File is too large to copy into sandbox, creating empty file": "O arquivo é muito grande para ser copiado para o sandbox, criando um arquivo vazio",

"SBIE2114: File is too large to copy into sandbox, denying access": "SBIE2114: O arquivo é muito grande para ser copiado para o sandbox, negando acesso",
"File is too large to copy into sandbox, denying access": "O arquivo é muito grande para ser copiado para o sandbox, negando acesso",

"SBIE2115: File is too large to copy into sandbox, opening in read only": "SBIE2115: O arquivo é muito grande para ser copiado para o sandbox, abrindo somente leitura",
"File is too large to copy into sandbox, opening in read only": "O arquivo é muito grande para ser copiado para o sandbox, abrindo somente leitura",

"SBIE2181: Failed to load SbieDll.dll": "SBIE2181: Falha ao carregar SbieDll.dll",
"Fix the DACLs of Sandboxie's home folder": "Corrigir os DACLs da pasta inicial do Sandboxie",
"Failures to load SbieDll.dll when encountered by Chrome, or another software employing app containers, it is often caused by invalid DACL entries for the Sandboxie home directory. This mitigation measure will fix them, for this reason it will prompt for admin privileges which need to be granted for kmdutil.exe.": "Falhas ao carregar SbieDll.dll quando encontrado pelo Chrome ou outro software que emprega contêineres de aplicativos, geralmente são causadas por entradas DACL inválidas para o diretório inicial do Sandboxie. Essa medida de mitigação irá corrigi-los, por isso solicitará privilégios de administrador que precisam ser concedidos para kmdutil.exe.",
"The DACLs have been adjusted, please try to run your application again and indicate if the issue has been resolved.": "As DACLs foram ajustadas, tente executar sua aplicação novamente e indique se o problema foi resolvido.",
"DACLs fix did not resolve the issue": "A correção de DACLs não resolveu o problema",

"SBIE2204: Cannot start a specific sandboxed service": "SBIE2204: Não é possível iniciar um serviço específico na caixa de areia",
"Sandboxie failed to start a service in the sandbox": "Sandboxie falhou ao iniciar um serviço na caixa",
"The message indicates that Sandboxie was unable to start one of the helper programs SandboxieRpcSs or SandboxieDcomLaunch. The name noted in the message can be rpcss or dcomlaunch.\n\nYou can submit an issue report on the next page to help us to analyze the issue.": "A mensagem indica que o Sandboxie não conseguiu iniciar um dos programas auxiliares SandboxieRpcSs ou SandboxieDcomLaunch. O nome indicado na mensagem pode ser rpcss ou dcomlaunch.\n\nVocê pode enviar um relatório de problema na próxima página para nos ajudar a analisar o problema.",

"SBIE2313: Could not execute specific process": "SBIE2313: Não foi possível executar processo específico",
"Sandboxie failed to start a process in the sandbox": "Sandboxie não conseguiu iniciar um processo no sandbox",
"Sandboxie was not able to execute one of its own programs. Check access permissions to the Sandboxie installation folder and/or reinstall Sandboxie.\n\nPossible Causes:\n1. Sandboxie was configured to block access to the folder containing its program files.\n2. A third-party (HIPS) security software was configured to block the execution of the program mentioned in the message.\n\nYou can submit an issue report on the next page to help us to analyze the issue.": "O Sandboxie não conseguiu executar um de seus próprios programas. Verifique as permissões de acesso à pasta de instalação do Sandboxie ou reinstale o Sandboxie.\n\nCausas Possíveis:\n1. Sandboxie foi configurado para bloquear o acesso à pasta que contém seus arquivos de programa.\n2. Um software de segurança de terceiros (HIPS) foi configurado para bloquear a execução do programa mencionado na mensagem.\n\nVocê pode enviar um relatório de problema na próxima página para nos ajudar a analisar o problema.",

"open config": "abrir configuração",
"opens box config on a given page": "abre a configuração da caixa em uma determinada página",
"Do you want to open the box option dialog to change this preset?": "Deseja abrir a caixa de diálogo de opções da caixa para alterar essa predefinição?",
"No, it is fine as it is": "Não, está tudo bem como está",
"No, but I want to report a bug": "Não, mas quero relatar um bug",

"SBIE 2113/2114/2115 and 2102": "SBIE 2113/2114/2115 e 2102",
"handle migration error messages": "lidar com mensagens de erro de migração",
"The message %1 is caused by the file migration limit being reached.": "A mensagem %1 é causada porque o limite de migração de arquivos foi atingido.",

"fix parental controls breaking sandboxie": "corrigir o controle dos pais quebrando o sandboxie",
"stops AppId driver and AppIdSvc service and disables the offending policy file": "interrompe o driver AppId e o serviço AppIdSvc e desativa o arquivo de política incorreto",
"It seems you are using a non-administrative user account on a system with enabled parental controls, this is known to be incompatible with Sandboxie.\nYou have the following options to resolve the issue.": "Parece que você está usando uma conta de usuário não administrativa em um sistema com controle parental ativado. Sabe-se que isso é incompatível com o Sandboxie.\nVocê tem as seguintes opções para resolver o problema.",

"SBIEMSG, I'm getting a cryptic SBIExxxx message": "SBIEMSG, estou recebendo uma mensagem enigmática do SBIExxxx",
"Handle all sbie messages...": "Lidar com todas as mensagens do sbie...",
"Sbie Message Code": "Código de Mensagem Sbie",
"Name affected process": "Nome de processo afetado",
"Please enter the SBIEMSG ID you have encountered.": "Por favor, insira o ID do SBIEMSG que você encontrou.",
"There is no automated troubleshooting available for SBIE%1 yet.<br />": "Ainda não há solução de problemas automatizada disponível para SBIE%1.<br />",
"The full message text is: %1<br />": "O texto completo da mensagem é: %1<br />",
"Visit out <a href=\"%1\">online-documentation</a> to learn more about this, and other sbie messages.": "Visite <a href=\"%1\">documentação-online</a> para saber mais sobre isso e outras mensagens do sbie.",
"Would you like to collect some logs to help us resolve the issue.": "Você gostaria de coletar alguns registros para nos ajudar a resolver o problema?",
"Now please run your application again to trigger the Sbie message.<br /><br />": "Agora execute seu aplicativo novamente para acionar a mensagem Sbie.<br /><br />",
"Press NEXT when you are done collecting logs.": "Pressione PRÓXIMO quando terminar de coletar os logs."
}
